'''Задания для тренировки
1 Вывести числа от 1 до 20.
2 Вывести только нечётные числа от 1 до 20.
3 Найти сумму чисел от 1 до 100.
4 Посчитать количество букв в строке "Python", используя for.
5 Вывести таблицу умножения на 5:'''

#1
# for i in range(1,21):
#     print(i)

# # 2
# for i in range(1,21):
#     if i % 2:
#         print(i)

# 3
# total = 0
# for i in range(0, 101):
#     total += i
# print(total)

#4
# txt = "Python"
# count = 0
# for char in txt:
#     count += 1
# print(f"Количестве букавок в слопе Python: {count}")

#5
for i in range (1,11):
    print(f" 5 * {i} = {5 * 1}")

'''Цикл for

range(1, 11) создаёт последовательность чисел:

Верхняя граница 11 не включается.

На каждой итерации переменная i получает следующее значени'''
